nv-string-basic
===============
- nv-string-basic    
- some basic string utils
- length ,number 
- reusable-nonnest-string-template

install
=======
- npm install nv-string-basic 

usage
=====
    
example
-------

###to\_str

    const {to_str} = require("nv-string-basic")
    > to_str(undefined)
    'undefined'
    > to_str(null)
    'null'
    > to_str(123)
    '123'
    > to_str(123n)
    '123n'
    > to_str('abc')
    'abc'
    > to_str(Symbol('sym'))
    'sym'
    > console.log(to_str({a:100}))
    {
        "a": 100
    }
    undefined
    > console.log(to_str([100,200,300]))
    [
        100,
        200,
        300
    ]
    undefined
    > class O {
         [util.inspect.custom]() {
             return('custom')
         }
    }
    > var o = new O()
    > to_str(o)
    'custom'
    >
    
    > function tst() {return(999)}
    undefined
    > to_str(tst)
    'function tst() {return(999)}'
    >



### stmpl and dtmpl

    //first compile
    var reuseable = stmpl`${0}-${1}-${2}-${`${3}`}`

    > reuseable('x','y','z','nest2')
    'x-y-z-nest2'
    >


    > reuseable('x','y')
    'x-y--'
    >

    //first compile
    var reuseable = stmpl`
        <${0}>
            <${1}></${1}>
            <${1}></${1}>
            <${1}></${1}>
            <${1}></${1}>
        </${0}>
    `

    var s = reusable('div','span')


    <div>
        <span></span>
        <span></span>
        <span></span>
        <span></span>
    </div>


     
    > console.log(reuseable('head','meta'))

        <head>
            <meta></meta>
            <meta></meta>
            <meta></meta>
            <meta></meta>
        </head>

    undefined
    >


    //
    var reusable = dtmpl`${'b'}-${'i'}-${'a'}-${`${'t'}`}`

    reusable({
        b:'before',
        i:'in',
        a:'after',
        t:'tail'
    })
    
    >
    'before-in-after-tail'
   
    
    var reusable = dtmpl`
        ${'obj_open'}
            ${'ary_open'} 100,200,300,400 ${'ary_close'}
        ${'obj_close'}
    `
    
    var s = reusable({
        obj_open: '„Äê',
        obj_close: '„Äë',
        ary_open:'<',
        ary_close:'>'
    })


    > console.log(s)

            „Äê
                < 100,200,300,400 >
            „Äë

    >


    var s = reusable({
        obj_open: '<div>',
        obj_close: '</div>',
        ary_open:'<ul>',
        ary_close:'</ul>'
    })


    > console.log(s)

            <div>
                <ul> 100,200,300,400 </ul>
            </div>

    >


    var reusable = dtmpl`
        ${'open'}
            ${'open'} ${'close'}
            ${'open'} ${'close'}
            ${'open'} ${'close'}
        ${'close'}
    `
    
    var s = reusable({open:'<div>',close:'</div>'})
    

    > console.log(s)

            <div>
                <div> </div>
                <div> </div>
                <div> </div>
            </div>

    >

    
    var s = reusable({open:'<custom>',close:'</custom>'})


        <custom>
            <custom> </custom>
            <custom> </custom>
            <custom> </custom>
        </custom>



    /*
         because string-literal-template is a runtime feature,
         so stmpl and dtmpl NOT support nest ``,
         to handle nest need to parse the template-source and implement the evaluate ,refer to nv-facutil-nest-string-tem,
         its NOT convinient to use, USELESS,
    */


### num

    > const {prepend_num,append_num} = require("nv-string-basic")
    undefined
    > append_num(5,2,4)
    '1010'
    > prepend_num(5,2,4)
    '0101'
    >


### loose parse\_num


    parse_num("1122334455667788998877665544332211n")
    parse_num("-1122334455667788998877665544332211n")
    
    parse_num("123")
    parse_num("-123")
    parse_num("0x1101")
    parse_num("0b1101")
    parse_num("0o1101")
    
    
    parse_num("123.12")
    parse_num("-123.12")
    parse_num("123.12e3")
    parse_num("-123.12e3")
    
    parse_num("123.12e+3")
    parse_num("-123.12e-3")
    
    
    parse_num("2e0.5")
    parse_num("-2e0.5")
    
    
    > parse_num("1122334455667788998877665544332211n")
    1122334455667788998877665544332211n
    > parse_num("-1122334455667788998877665544332211n")
    -1122334455667788998877665544332211n
    >
    > parse_num("123")
    123
    > parse_num("-123")
    -123
    >
    
    > parse_num("0x1101")
    4353
    > parse_num("0b1101")
    13
    > parse_num("0o1101")
    577
    
    > parse_num("123.12")
    123.12
    > parse_num("-123.12e3")
    -123120
    >
    
    > parse_num("123.12e3")
    123120
    > parse_num("12e2")
    1200
    
    > parse_num("123.12e+3")
    123120
    > parse_num("-123.12e-3")
    -0.12312
    >
    
    >
    > parse_num("2e0.5")
    6.324555320336759       //    2 * (10 ** 0.5)
    >
    > parse_num("-2e0.5")
    -6.324555320336759
    >
    > parse_num("+2e0.5")
    6.324555320336759
    > parse_num("-2e0.5")
    -6.324555320336759
    >


### keep the type infomation 


    > NUM_TYPE_DICT
    {
      '6': 'Integer',
      '7': 'Float',
      '8': 'BigInt',
      '9': 'PosInfinity',
      '10': 'NegInfinity',
      '11': 'NaN',
      Integer: 6,
      Float: 7,
      BigInt: 8,
      PosInfinity: 9,
      NegInfinity: 10,
      NaN: 11
    }
    > parse_num("1122334455667788998877665544332211n",true)
    { value: 1122334455667788998877665544332211n, type: 8 }
    > parse_num("123",true)
    { value: 123, type: 6 }
    > NUM_TYPE_DICT[6]
    'Integer'
    > parse_num("123.",true)
    { value: 123, type: 7 }
    > NUM_TYPE_DICT[7]
    'Float'
    >
    > parse_num("123e2",true)
    { value: 12300, type: 7 }
    > NUM_TYPE_DICT[7]
    'Float'
    >
    > parse_num("Infinity",true)
    { value: Infinity, type: 9 }
    > NUM_TYPE_DICT[9]
    'PosInfinity'
    > parse_num("+Infinity",true)
    { value: Infinity, type: 9 }
    > NUM_TYPE_DICT[9]
    'PosInfinity'
    > parse_num("-Infinity",true)
    { value: -Infinity, type: 10 }
    > NUM_TYPE_DICT[9]
    'PosInfinity'
    > NUM_TYPE_DICT[10]
    'NegInfinity'
    > parse_num("NaN",true)
    { value: NaN, type: 11 }
    > NUM_TYPE_DICT[11]
    'NaN'
    >


### loose parse\_int

    parse_int("0b1101")
    0b1101
    parse_int("0o1101")
    0o1101
    parse_int("0x1101")
    0x1101
    parse_int("1101")

    > parse_int("af") === undefined
    > parse_int("0xaf")
    175
    >


    /*
    > parse_int("0b1101")
    13
    > 0b1101
    13
    > parse_int("0o1101")
    577
    > 0o1101
    577
    > parse_int("0x1101")
    4353
    > 0x1101
    4353
    > parse_int("1101")
    1
    >

    */



### strict parse\_float


    //valid  and same as  parseFloat
    parse_float("1")
    parse_float("-1")
    parse_float(".1")
    parse_float("-.1")
    parse_float("1.")
    parse_float("-1.")
    parse_float("-1.1")
    parse_float("1.1")
    parse_float("-1.1e2")
    parse_float(".1E3")
    /*
    > parse_float("1")
    1
    > parse_float("-1")
    -1
    > parse_float(".1")
    0.1
    > parse_float("-.1")
    -0.1
    > parse_float("1.")
    1
    > parse_float("-1.")
    -1
    > parse_float("-1.1")
    -1.1
    > parse_float("1.1")
    1.1
    >
    > parse_float("-1.1e2")
    -110
    >
    > parse_float(".1E3")
    100
    
    */
    
    //valid  but different with parseFloat
    
    parse_float("1.1e")
    parse_float("-1.1e")
    parse_float("-1.1e2.5")
    parse_float(".1E3.")
    parse_float(".1E3.13")
    /*
    > parse_float("1.1e")
    1.1
    > parse_float("-1.1e")
    -1.1
    > parse_float("-1.1e2.5")
    -347.85054261852173
    >
    > parse_float(".1E3.")
    100
    > parse_float(".1E3.13")
    134.89628825916535
    >
    
    */
    
    //invalid
    parse_float(".") === undefined 
    parse_float("1.2.") === undefined 
    parse_float("-.") === undefined



### parse0  only parse undefined/null/boolean/number 

    > parse0('undefined')
    undefined
    > parse0('null')
    null
    > parse0('true')
    true
    > parse0('false')
    false
    > parse0('123')
    123
    > parse0('123e2')
    12300
    > parse0('Infinity')
    Infinity
    > parse0('-Infinity')
    -Infinity
    > parse0('-NaN')
    NaN
    > parse0('NaN')
    NaN

    > parse0('ssss')
    ssss
    >



reverse
-------

    var s = "abc"
    > reverse(s)
    'cba'
    >

trim
----

    var s = '   \t\r\na b c'
    > trim_left(s)
    'a b c'
    >

    var s = 'abcabc d e f abc'
    > trim_left(s,"abc ")
    'd e f abc'
    >
    > trim_right(s,"abc ")
    'abcabc d e f'
    >
    > trim(s,"abc ")
    'd e f'
    >

    > trim(s,["abcabc"," abc"])
    ' d e f'
    >
    var s = 'Êàë‰Ω† a b c   ÂÆÉ'

    trim(s,(ch)=>ch.codePointAt(0)>256 ||ch.codePointAt(0)===32 )
    > trim(s,(ch)=>ch.codePointAt(0)>256 ||ch.codePointAt(0)===32 )
    'a b c'
    >

    var s = '%$# abc !!@'
    > trim_left(s,/^[^a-z]+/)
    'abc !!@'
    > trim_right(s,/[^a-z]+$/)
    '%$# abc'
    >


gen\_split
----------

    > var g = gen_splits("abcd")
    undefined
    > Array.from(g)
    [
      [ 'abcd' ],
      [ 'a', 'bcd' ],
      [ 'ab', 'cd' ],
      [ 'a', 'b', 'cd' ],
      [ 'abc', 'd' ],
      [ 'a', 'bc', 'd' ],
      [ 'ab', 'c', 'd' ],
      [ 'a', 'b', 'c', 'd' ]
    ]
    > var g = gen_splits("abcd",2)
    undefined
    > Array.from(g)
    [ [ 'a', 'bcd' ], [ 'ab', 'cd' ], [ 'abc', 'd' ] ]
    >

### u-string

    var s = 'ùëí';
    > Array.from(s).length;
    1
    > s.length
    2
    >



    > u(s);
    '\\ud835\\udc52'
    >
    > from_u('\\ud835\\udc52')
    'ùëí'
    >



    > u('A-ùëí-B')
    '\\u0041\\u002d\\ud835\\udc52\\u002d\\u0042'
    >
    > from_u('\\u0041\\u002d\\ud835\\udc52\\u002d\\u0042')
    'A-ùëí-B'
    >


    > u('A-ùëí-B',true)
    'A-\\ud835\\udc52-B'
    >
    > from_u('A-\\ud835\\udc52-B')
    'A-ùëí-B'
    >


API
====

- to\_str(o)

- stmpl`tmpl`
- dtmpl`tmpl`

- prepend(s,width,pad=" ",force=false)
- append(s,width,pad=" ",force=false)

- prepend\_num(n,radix,width,pad="0",force=false)
- append\_num(n,radix,width,pad="0",force=false)

- is\_bdigit\_ch(ch)
- is\_bdigit\_str(s)
- is\_odigit\_ch(ch)
- is\_odigit\_str(s)
- is\_ddigit\_ch(ch)
- is\_ddigit\_str(s)
- is\_hdigit\_ch(ch)
- is\_hdigit\_str(s)
- is\_ndigit\_ch(n,ch)   //n <=36
- is\_ndigit\_str(n,s)   //n <=36
- slength(s)
- blength(s)
- u16length(s)


- parse\_num(s)               //bigint-str  int-str   0xaf 0b1001 0o555
- is\_jsint\_str(s)           //123   0xaf
- parse\_int(s)               //123   0xaf  0b1001   0o555
- is\_int\_str(s)             //123   0xaf  0b1001   0o555
- is\_ary\_idx\_str(s)        //is\_int\_str(s) && >=0 && < 2**32 -1
- is\_bigint\_str(s)
- is\_float\_str(s)
- parse\_float(s)          //strict  ".5.6" not valid, 
-                          //"." not valid 
-                          //"-." not valid, 
-                          //"-1.1e2.5"   ===  -1.1 * (10 ** 2.5) 
-                          //others same as parseFloat

- LOWER\_CASE\_ATOZ\_STR
- UPPER\_CASE\_ATOZ\_STR
- LOWER\_CASE\_ATOZ\_MD
- UPPER\_CASE\_ATOZ\_MD

- parse0(s,cfg= {only\_value:true,with\_value:true,with\_type:false,unknown\_as\_string:false})
- parse0.unknown


- reverse(s)
- trim\_left(s,cond:String|RegExp|(ch)=\>Boolean)
- trim\_right(s,cond:String|RegExp|(ch)=\>Boolean)
- trim(s,cond:String|RegExp|(ch)=\>Boolean)

- DFLT\_TRIM\_LEFT\_REGEXP
- DFLT\_TRIM\_RIGHT\_REGEXP
- DFLT\_TRIM\_REGEXP

- gen\_split\_two(s)
- gen\_splits(s,n)

- u(s,ignore_length_one=false)
- from_u(s)

LICENSE
=======
- ISC 
